test/cassettes/shipments/refund.yml


-
    request:
        method: POST
        url: 'https://api.easypost.com/v2/shipments'
        headers:
            Host: api.easypost.com
            Accept: application/json
            Authorization: ''
            Content-Type: application/json
            User-Agent: ''
            X-Client-User-Agent: ''
            EasyPost-Version: '2'
        body: '{"shipment":{"to_address":{"name":"Jack Sparrow","company":"EasyPost","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","phone":"5555555555"},"from_address":{"name":"Jack Sparrow","company":"EasyPost","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","phone":"5555555555"},"parcel":{"length":"10","width":"8","height":"4","weight":"15.4"},"service":"First","carrier_accounts":["ca_8dc116debcdb49b5a66a2ddee4612600"],"carrier":"USPS"}}'
    response:
        status:
            http_version: '2'
            code: '201'
            message: ''
        headers:
            x-frame-options: SAMEORIGIN
            x-xss-protection: '1; mode=block'
            x-content-type-options: nosniff
            x-download-options: noopen
            x-permitted-cross-domain-policies: none
            referrer-policy: strict-origin-when-cross-origin
            x-ep-request-uuid: 2f26e945627ed413e798bbe00006f9b9
            cache-control: 'no-cache, no-store'
            pragma: no-cache
            expires: '0'
            location: /api/v2/shipments/shp_f86abcbed55a45edb4f7f064af50d64c
            content-type: 'application/json; charset=utf-8'
            content-length: '7049'
            etag: 'W/"6f983191b6ae84c1ed0e4bfebf62382a"'
            x-runtime: '1.229295'
            x-node: bigweb8nuq
            x-version-label: easypost-202205131956-9146889ba0-master
            x-backend: easypost
            x-proxied: ['intlb2nuq 570dfcbc0a', 'extlb1nuq c51cdb8bf2']
            strict-transport-security: 'max-age=31536000; includeSubDomains; preload'
        body: '{"created_at":"2022-05-13T21:56:35Z","is_return":false,"messages":[],"mode":"test","options":{"currency":"USD","payment":{"type":"SENDER"},"date_advance":0},"reference":null,"status":"unknown","tracking_code":"9400100109361119108244","updated_at":"2022-05-13T21:56:37Z","batch_id":null,"batch_status":null,"batch_message":null,"customs_info":null,"from_address":{"id":"adr_8f0aea36d30711ec8e51ac1f6bc7b362","object":"Address","created_at":"2022-05-13T21:56:35+00:00","updated_at":"2022-05-13T21:56:35+00:00","name":"Jack Sparrow","company":"EasyPost","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":[]},"insurance":"50.00","order_id":null,"parcel":{"id":"prcl_c1624a4d4e62448295380bc028badf3e","object":"Parcel","created_at":"2022-05-13T21:56:35Z","updated_at":"2022-05-13T21:56:35Z","length":10,"width":8,"height":4,"predefined_package":null,"weight":15.4,"mode":"test"},"postage_label":{"object":"PostageLabel","id":"pl_42b849a2955b4d3b8c983555b77f740c","created_at":"2022-05-13T21:56:36Z","updated_at":"2022-05-13T21:56:36Z","date_advance":0,"integrated_form":"none","label_date":"2022-05-13T21:56:36Z","label_resolution":300,"label_size":"4x6","label_type":"default","label_file_type":"image\/png","label_url":"https:\/\/easypost-files.s3.us-west-2.amazonaws.com\/files\/postage_label\/20220513\/5aace8e3586743e7967934e3615f0327.png","label_pdf_url":null,"label_zpl_url":null,"label_epl2_url":null,"label_file":null},"rates":[{"id":"rate_4374aecaf33148da85b3a3a19bbdd2cf","object":"Rate","created_at":"2022-05-13T21:56:36Z","updated_at":"2022-05-13T21:56:36Z","mode":"test","service":"Express","carrier":"USPS","rate":"23.75","currency":"USD","retail_rate":"27.40","retail_currency":"USD","list_rate":"23.75","list_currency":"USD","billing_type":"easypost","delivery_days":null,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":null,"shipment_id":"shp_f86abcbed55a45edb4f7f064af50d64c","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_6b63e621df4949cc860a98b50ff42b71","object":"Rate","created_at":"2022-05-13T21:56:36Z","updated_at":"2022-05-13T21:56:36Z","mode":"test","service":"ParcelSelect","carrier":"USPS","rate":"7.22","currency":"USD","retail_rate":"7.22","retail_currency":"USD","list_rate":"7.22","list_currency":"USD","billing_type":"easypost","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_f86abcbed55a45edb4f7f064af50d64c","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_1179a5e4543f4802ba51b1df447bfdcb","object":"Rate","created_at":"2022-05-13T21:56:36Z","updated_at":"2022-05-13T21:56:36Z","mode":"test","service":"Priority","carrier":"USPS","rate":"7.37","currency":"USD","retail_rate":"8.70","retail_currency":"USD","list_rate":"7.37","list_currency":"USD","billing_type":"easypost","delivery_days":1,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":1,"shipment_id":"shp_f86abcbed55a45edb4f7f064af50d64c","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_ef65a8f7a0ae4fa183603abc302e5abc","object":"Rate","created_at":"2022-05-13T21:56:36Z","updated_at":"2022-05-13T21:56:36Z","mode":"test","service":"First","carrier":"USPS","rate":"5.49","currency":"USD","retail_rate":"5.49","retail_currency":"USD","list_rate":"5.49","list_currency":"USD","billing_type":"easypost","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_f86abcbed55a45edb4f7f064af50d64c","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"}],"refund_status":null,"scan_form":null,"selected_rate":{"id":"rate_ef65a8f7a0ae4fa183603abc302e5abc","object":"Rate","created_at":"2022-05-13T21:56:36Z","updated_at":"2022-05-13T21:56:36Z","mode":"test","service":"First","carrier":"USPS","rate":"5.49","currency":"USD","retail_rate":"5.49","retail_currency":"USD","list_rate":"5.49","list_currency":"USD","billing_type":"easypost","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_f86abcbed55a45edb4f7f064af50d64c","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},"tracker":{"id":"trk_75016b6a150a44b8ab3196c5d969f7e4","object":"Tracker","mode":"test","tracking_code":"9400100109361119108244","status":"unknown","status_detail":"unknown","created_at":"2022-05-13T21:56:37Z","updated_at":"2022-05-13T21:56:37Z","signed_by":null,"weight":null,"est_delivery_date":null,"shipment_id":"shp_f86abcbed55a45edb4f7f064af50d64c","carrier":"USPS","tracking_details":[],"fees":[],"carrier_detail":null,"public_url":"https:\/\/track.easypost.com\/djE6dHJrXzc1MDE2YjZhMTUwYTQ0YjhhYjMxOTZjNWQ5NjlmN2U0"},"to_address":{"id":"adr_8f08edb4d30711ec8e50ac1f6bc7b362","object":"Address","created_at":"2022-05-13T21:56:35+00:00","updated_at":"2022-05-13T21:56:36+00:00","name":"JACK SPARROW","company":"EASYPOST","street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America\/Los_Angeles"}}}},"usps_zone":1,"return_address":{"id":"adr_8f0aea36d30711ec8e51ac1f6bc7b362","object":"Address","created_at":"2022-05-13T21:56:35+00:00","updated_at":"2022-05-13T21:56:35+00:00","name":"Jack Sparrow","company":"EasyPost","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":[]},"buyer_address":{"id":"adr_8f08edb4d30711ec8e50ac1f6bc7b362","object":"Address","created_at":"2022-05-13T21:56:35+00:00","updated_at":"2022-05-13T21:56:36+00:00","name":"JACK SPARROW","company":"EASYPOST","street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America\/Los_Angeles"}}}},"forms":[],"fees":[{"object":"Fee","type":"LabelFee","amount":"0.00000","charged":true,"refunded":false},{"object":"Fee","type":"PostageFee","amount":"5.49000","charged":true,"refunded":false},{"object":"Fee","type":"InsuranceFee","amount":"0.25000","charged":true,"refunded":false}],"id":"shp_f86abcbed55a45edb4f7f064af50d64c","object":"Shipment"}'
        curl_info:
            url: 'https://api.easypost.com/v2/shipments'
            content_type: 'application/json; charset=utf-8'
            http_code: 201
            header_size: 785
            request_size: 560
            filetime: -1
            ssl_verify_result: 0
            redirect_count: 0
            total_time: 1.422742
            namelookup_time: 0.0024
            connect_time: 0.062529
            pretransfer_time: 0.131436
            size_upload: 528.0
            size_download: 7049.0
            speed_download: 4954.0
            speed_upload: 371.0
            download_content_length: 7049.0
            upload_content_length: 528.0
            starttransfer_time: 0.131437
            redirect_time: 0.0
            redirect_url: ''
            primary_ip: 169.62.110.131
            certinfo: {  }
            primary_port: 443
            local_ip: 10.130.6.6
            local_port: 60067
            http_version: 3
            protocol: 2
            ssl_verifyresult: 0
            scheme: HTTPS
            appconnect_time_us: 131389
            connect_time_us: 62529
            namelookup_time_us: 2400
            pretransfer_time_us: 131436
            redirect_time_us: 0
            starttransfer_time_us: 131437
            total_time_us: 1422742
-
    request:
        method: GET
        url: 'https://api.easypost.com/v2/shipments/shp_f86abcbed55a45edb4f7f064af50d64c/refund'
        headers:
            Host: api.easypost.com
            Accept: application/json
            Authorization: ''
            Content-Type: application/json
            User-Agent: ''
            X-Client-User-Agent: ''
            EasyPost-Version: '2'
    response:
        status:
            http_version: '2'
            code: '200'
            message: ''
        headers:
            x-frame-options: SAMEORIGIN
            x-xss-protection: '1; mode=block'
            x-content-type-options: nosniff
            x-download-options: noopen
            x-permitted-cross-domain-policies: none
            referrer-policy: strict-origin-when-cross-origin
            x-ep-request-uuid: 2f26e941627ed415e798bbe10006fa23
            cache-control: 'no-cache, no-store'
            pragma: no-cache
            expires: '0'
            content-type: 'application/json; charset=utf-8'
            content-length: '8190'
            etag: 'W/"f494c9171aec9eb7fadff12b182d8b3e"'
            x-runtime: '0.146819'
            x-node: bigweb9nuq
            x-version-label: easypost-202205131956-9146889ba0-master
            x-backend: easypost
            x-proxied: ['intlb1nuq 570dfcbc0a', 'extlb1nuq c51cdb8bf2']
            strict-transport-security: 'max-age=31536000; includeSubDomains; preload'
        body: '{"created_at":"2022-05-13T21:56:35Z","is_return":false,"messages":[],"mode":"test","options":{"currency":"USD","payment":{"type":"SENDER"},"date_advance":0},"reference":null,"status":"unknown","tracking_code":"9400100109361119108244","updated_at":"2022-05-13T21:56:37Z","batch_id":null,"batch_status":null,"batch_message":null,"customs_info":null,"from_address":{"id":"adr_8f0aea36d30711ec8e51ac1f6bc7b362","object":"Address","created_at":"2022-05-13T21:56:35+00:00","updated_at":"2022-05-13T21:56:35+00:00","name":"Jack Sparrow","company":"EasyPost","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":[]},"insurance":"50.00","order_id":null,"parcel":{"id":"prcl_c1624a4d4e62448295380bc028badf3e","object":"Parcel","created_at":"2022-05-13T21:56:35Z","updated_at":"2022-05-13T21:56:35Z","length":10,"width":8,"height":4,"predefined_package":null,"weight":15.4,"mode":"test"},"postage_label":{"object":"PostageLabel","id":"pl_42b849a2955b4d3b8c983555b77f740c","created_at":"2022-05-13T21:56:36Z","updated_at":"2022-05-13T21:56:36Z","date_advance":0,"integrated_form":"none","label_date":"2022-05-13T21:56:36Z","label_resolution":300,"label_size":"4x6","label_type":"default","label_file_type":"image\/png","label_url":"https:\/\/easypost-files.s3.us-west-2.amazonaws.com\/files\/postage_label\/20220513\/5aace8e3586743e7967934e3615f0327.png","label_pdf_url":null,"label_zpl_url":null,"label_epl2_url":null,"label_file":null},"rates":[{"id":"rate_4374aecaf33148da85b3a3a19bbdd2cf","object":"Rate","created_at":"2022-05-13T21:56:36Z","updated_at":"2022-05-13T21:56:36Z","mode":"test","service":"Express","carrier":"USPS","rate":"23.75","currency":"USD","retail_rate":"27.40","retail_currency":"USD","list_rate":"23.75","list_currency":"USD","billing_type":"easypost","delivery_days":null,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":null,"shipment_id":"shp_f86abcbed55a45edb4f7f064af50d64c","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_6b63e621df4949cc860a98b50ff42b71","object":"Rate","created_at":"2022-05-13T21:56:36Z","updated_at":"2022-05-13T21:56:36Z","mode":"test","service":"ParcelSelect","carrier":"USPS","rate":"7.22","currency":"USD","retail_rate":"7.22","retail_currency":"USD","list_rate":"7.22","list_currency":"USD","billing_type":"easypost","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_f86abcbed55a45edb4f7f064af50d64c","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_1179a5e4543f4802ba51b1df447bfdcb","object":"Rate","created_at":"2022-05-13T21:56:36Z","updated_at":"2022-05-13T21:56:36Z","mode":"test","service":"Priority","carrier":"USPS","rate":"7.37","currency":"USD","retail_rate":"8.70","retail_currency":"USD","list_rate":"7.37","list_currency":"USD","billing_type":"easypost","delivery_days":1,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":1,"shipment_id":"shp_f86abcbed55a45edb4f7f064af50d64c","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_ef65a8f7a0ae4fa183603abc302e5abc","object":"Rate","created_at":"2022-05-13T21:56:36Z","updated_at":"2022-05-13T21:56:36Z","mode":"test","service":"First","carrier":"USPS","rate":"5.49","currency":"USD","retail_rate":"5.49","retail_currency":"USD","list_rate":"5.49","list_currency":"USD","billing_type":"easypost","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_f86abcbed55a45edb4f7f064af50d64c","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"}],"refund_status":"submitted","scan_form":null,"selected_rate":{"id":"rate_ef65a8f7a0ae4fa183603abc302e5abc","object":"Rate","created_at":"2022-05-13T21:56:36Z","updated_at":"2022-05-13T21:56:36Z","mode":"test","service":"First","carrier":"USPS","rate":"5.49","currency":"USD","retail_rate":"5.49","retail_currency":"USD","list_rate":"5.49","list_currency":"USD","billing_type":"easypost","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_f86abcbed55a45edb4f7f064af50d64c","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},"tracker":{"id":"trk_75016b6a150a44b8ab3196c5d969f7e4","object":"Tracker","mode":"test","tracking_code":"9400100109361119108244","status":"pre_transit","status_detail":"status_update","created_at":"2022-05-13T21:56:37Z","updated_at":"2022-05-13T21:56:37Z","signed_by":null,"weight":null,"est_delivery_date":"2022-05-13T21:56:37Z","shipment_id":"shp_f86abcbed55a45edb4f7f064af50d64c","carrier":"USPS","tracking_details":[{"object":"TrackingDetail","message":"Pre-Shipment Info Sent to USPS","description":null,"status":"pre_transit","status_detail":"status_update","datetime":"2022-04-13T21:56:37Z","source":"USPS","carrier_code":null,"tracking_location":{"object":"TrackingLocation","city":null,"state":null,"country":null,"zip":null}},{"object":"TrackingDetail","message":"Shipping Label Created","description":null,"status":"pre_transit","status_detail":"status_update","datetime":"2022-04-14T10:33:37Z","source":"USPS","carrier_code":null,"tracking_location":{"object":"TrackingLocation","city":"HOUSTON","state":"TX","country":null,"zip":"77063"}}],"fees":[],"carrier_detail":{"object":"CarrierDetail","service":"First-Class Package Service","container_type":null,"est_delivery_date_local":null,"est_delivery_time_local":null,"origin_location":"HOUSTON TX, 77001","origin_tracking_location":{"object":"TrackingLocation","city":"HOUSTON","state":"TX","country":null,"zip":"77063"},"destination_location":"CHARLESTON SC, 29401","destination_tracking_location":null,"guaranteed_delivery_date":null,"alternate_identifier":null,"initial_delivery_attempt":null},"public_url":"https:\/\/track.easypost.com\/djE6dHJrXzc1MDE2YjZhMTUwYTQ0YjhhYjMxOTZjNWQ5NjlmN2U0"},"to_address":{"id":"adr_8f08edb4d30711ec8e50ac1f6bc7b362","object":"Address","created_at":"2022-05-13T21:56:35+00:00","updated_at":"2022-05-13T21:56:36+00:00","name":"JACK SPARROW","company":"EASYPOST","street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America\/Los_Angeles"}}}},"usps_zone":1,"return_address":{"id":"adr_8f0aea36d30711ec8e51ac1f6bc7b362","object":"Address","created_at":"2022-05-13T21:56:35+00:00","updated_at":"2022-05-13T21:56:35+00:00","name":"Jack Sparrow","company":"EasyPost","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":[]},"buyer_address":{"id":"adr_8f08edb4d30711ec8e50ac1f6bc7b362","object":"Address","created_at":"2022-05-13T21:56:35+00:00","updated_at":"2022-05-13T21:56:36+00:00","name":"JACK SPARROW","company":"EASYPOST","street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America\/Los_Angeles"}}}},"forms":[],"fees":[{"object":"Fee","type":"LabelFee","amount":"0.00000","charged":true,"refunded":false},{"object":"Fee","type":"PostageFee","amount":"5.49000","charged":true,"refunded":false},{"object":"Fee","type":"InsuranceFee","amount":"0.25000","charged":true,"refunded":false}],"id":"shp_f86abcbed55a45edb4f7f064af50d64c","object":"Shipment"}'
        curl_info:
            url: 'https://api.easypost.com/v2/shipments/shp_f86abcbed55a45edb4f7f064af50d64c/refund'
            content_type: 'application/json; charset=utf-8'
            http_code: 200
            header_size: 719
            request_size: 582
            filetime: -1
            ssl_verify_result: 0
            redirect_count: 0
            total_time: 0.347815
            namelookup_time: 0.001908
            connect_time: 0.061467
            pretransfer_time: 0.139009
            size_upload: 0.0
            size_download: 8190.0
            speed_download: 23547.0
            speed_upload: 0.0
            download_content_length: 8190.0
            upload_content_length: 0.0
            starttransfer_time: 0.347679
            redirect_time: 0.0
            redirect_url: ''
            primary_ip: 169.62.110.131
            certinfo: {  }
            primary_port: 443
            local_ip: 10.130.6.6
            local_port: 60068
            http_version: 3
            protocol: 2
            ssl_verifyresult: 0
            scheme: HTTPS
            appconnect_time_us: 138748
            connect_time_us: 61467
            namelookup_time_us: 1908
            pretransfer_time_us: 139009
            redirect_time_us: 0
            starttransfer_time_us: 347679
            total_time_us: 347815
